---
kind: method
id: M:Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetPlaneOfSketch
source: html/7074b059-f6cb-f044-a0d0-c4132dbd30ad.htm
---
# Autodesk.Revit.DB.PartMakerMethodToDivideVolumes.GetPlaneOfSketch Method

Gets the plane of the sketch.

## Syntax (C#)
```csharp
public Plane GetPlaneOfSketch()
```

## Returns
The plane of the sketch.